#2. Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.

def Maximum(a,b,c):
    return max(a,b,c)

print(Maximum(6,3,10))
